[
  {
    "episode": 123,
    "changes": "<p>The first \"predictions draft\", used \"round robin\" ordering in 3 rounds. <a href=\"https://overcast.fm/+FXx7nikbQ/26:58\" target=\"_blank\">Picks were not allowed to be too \"simple\"</a>, like \"Apple will release an iPhone\", they must be specific. Myke decides, apparently on the spot, that these predictions will be checked at the end of the year to pick a winner.</p>"
  },
  {
    "episode": 174,
    "changes": "<p>The Risky Pick round emerges fully formed from Federico's head after <a href=\"https://overcast.fm/+FXx75_MJc/05:42\" target=\"_blank\">he hears Myke describe wanting to go big</a> with <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#An%20iPhone%20Pro%20with%20Apple%20Pencil%20support%2C%202%20Apple%20Pencils\">a very specific pick</a>. Two points for a correct pick and loss of a point for an incorrect one, to be implemented for the first time in the <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#2018%20Annual%20Predictions\">2018 Annual Predictions</a>.</p>"
  },
  {
    "episode": 210,
    "changes": "<p><ul><li>It isn't clear when this rule was formally changed, but <a href=\"https://overcast.fm/+FXx5CD05Y/1:00\" target=\"_blank\">when re-litigating</a> a <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#iWork%20updates%20for%20iOS%2012\">grading decision</a> from the previous week, Myke firmly insists that \"there are no half points around here.\" (Quite a change of opinion from <a href=\"https://overcast.fm/+FXx5Kx09c/1:27:56\" target=\"_blank\">the previous week</a>, incidentally.)</li></ul></p>"
  },
  {
    "episode": 224,
    "changes": "<p><ul>\n<li>It is claimed that at some point in 2018, <a href=\"https://overcast.fm/+FXx495ZrA/01:10\" target=\"_blank\">Federico insisted that half points be banned</a>. (If this happened on-air, please <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#About\">let me know</a>.) This could be conflating the instigator of the rule change with the picker of <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#iWork%20updates%20for%20iOS%2012\">the pick that caused it</a>.</li>\n<li><a href=\"https://overcast.fm/+FXx495ZrA/07:45\" target=\"_blank\">\"Everything written down must come true\"</a> added as a result of <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Workflow%202%20will%20appear%20as%20a%20system%20feature%20or%20app\">this pick</a>.</li>\n</ul></p>"
  },
  {
    "episode": 236,
    "changes": "<p>The unwritten rule of resolving ties with Siri coin flips <a href=\"https://overcast.fm/+FXx75P5Bg/43:02\" target=\"_blank\">was established</a>.</p>"
  },
  {
    "episode": 243,
    "changes": "<p><a href=\"https://overcast.fm/+FXx6RiXe0/59:57\" target=\"_blank\">No reuse of picks added</a> as a new rule.</p>"
  },
  {
    "episode": 245,
    "changes": "<p>Stephen said \"Ricky\" instead of \"risky\" in an iMessage, and <a href=\"https://overcast.fm/+FXx6h7YDQ/18:26\" target=\"_blank\">now they're Ricky Picks</a>. The loser of the non-graded picks <a href=\"https://overcast.fm/+FXx6h7YDQ/1:02:03\" target=\"_blank\">has to buy drinks at the WWDC live show</a>.</p>"
  },
  {
    "episode": 259,
    "changes": "<p>Myke <a href=\"https://overcast.fm/+FXx5bRzKc/46:02\" target=\"_blank\">proposes naming the competition \"The Rickies\"</a>, after Stephen's now infamous typo. The rule about the previous winner going first <a href=\"https://overcast.fm/+FXx5bRzKc/49:30\" target=\"_blank\">is revised</a>. The title for the winner is <a href=\"https://overcast.fm/+FXx5bRzKc/51:23\" target=\"_blank\">\"Chairman Ricky\"</a>.</p>"
  },
  {
    "episode": 275,
    "changes": "<p>The practice of separating annual picks and event picks for the purpose of pick order <a href=\"https://overcast.fm/+FXx7hS2kY/07:00\" target=\"_blank\">was codified in the written rules</a>, after being <a href=\"https://overcast.fm/+FXx61sqT4/1:04:12\" target=\"_blank\">discussed in</a> <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Connected%20%23260%3A%20The%20Most%20Golden%20Master\">#260</a>. <a href=\"https://overcast.fm/+FXx7hS2kY/1:15:46\" target=\"_blank\">Stephen coins \"The Flexies\"</a>.</p>"
  },
  {
    "episode": 300,
    "changes": "<p>The \"ratio\" based tiebreaker for the Flexies <a href=\"https://overcast.fm/+FXx7KvDUI/47:27\" target=\"_blank\">is added</a>, and then the ideas start flowing. Instead of just buying drinks for the winner, bigger financial stakes are added. After much debate, the final decision is that the loser must pay both $25 per wrong Flexie to the winner's choice of charity and also purchase a surprise for the winner of the same amount. A 5 Flexie minimum is added. <a href=\"https://overcast.fm/+FXx7KvDUI/56:32\" target=\"_blank\">\"tondog\" in the Discord coins \"The Bill of Rickies\"</a>.</p>"
  },
  {
    "episode": 311,
    "changes": "<p><ul>\n<li>The title of \"Chairman Ricky\" <a href=\"https://overcast.fm/+FXx5XgcdI/34:12\" target=\"_blank\">is rephrased as</a> \"Keynote Chairman\" and \"Annual Chairman\".</li>\n<li>The Flexie rules <a href=\"https://overcast.fm/+FXx5XgcdI/37:45\" target=\"_blank\">are simplified back down</a> to just a donation to charity, dropping the additional gift to the winner.</li>\n<li>The existing Chairman Twitter accounts <a href=\"https://overcast.fm/+FXx5XgcdI/40:50\" target=\"_blank\">are explicitly added to the written rules</a>.</li>\n<li>For the first time, the reading of The Bill <a href=\"https://overcast.fm/+FXx5XgcdI/41:58\" target=\"_blank\">is given the solemn musical treatment it deserves</a>.</li>\n</ul></p>"
  },
  {
    "episode": 312,
    "changes": "<p>Donations for the Flexies <em>must</em> be done on the air <a href=\"https://overcast.fm/+FXx5peDck/1:17:13\" target=\"_blank\">after Stephen chooses to do so</a>.</p>"
  },
  {
    "episode": 316,
    "changes": "<p><ul><li><a href=\"https://overcast.fm/+FXx7YIi-0/1:12:44\" target=\"_blank\">Clarified that Flexies may be reused</a> (technically the \"no reuse\" rule wasn't in the Flexies section anyway, but it was agreed that banning their reuse would be too limiting).</li>\n<li>Myke <a href=\"https://overcast.fm/+FXx7YIi-0/42:01\" target=\"_blank\">notices that the rules do not identify when keynote picks can come true</a>, and proposes that the window open at the start of the event and close at grading. (He also noted this in <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Connected%20%23311%3A%20The%20Rickies%20%28September%202020%29\">#311</a> and <a href=\"https://overcast.fm/+FXx5XgcdI/1:05:54\" target=\"_blank\">proposed a similar rule change</a>, but it was never written down.) Stephen prefers starting at the publication of the prediction episode, but Federico breaks the tie in Myke's favor, agreeing that it is a competition about the event. Unlike <a href=\"https://upgrade.cards/\" target=\"_blank\">the Keynote Draft</a> on <a href=\"https://relay.fm/upgrade\" target=\"_blank\">Upgrade</a>, which only allows information from the presentation itself, ancillary material is allowed. For example, a specifications page that clarifies details may figure into grading as long as it is available at that time.</li>\n</ul></p>"
  },
  {
    "episode": 317,
    "changes": "<p><ul><li>More of a rules <em>non</em>-change, <a href=\"https://overcast.fm/+FXx4SOxUg/1:13\" target=\"_blank\">the hosts address the audience's feedback on the Bill</a>, emphasizing that the lopsided importance of the risky pick is a feature, not a bug. Listener Matthias' <a href=\"https://twitter.com/kingtritium/status/1316382470733025282?s=12\" target=\"_blank\">beautiful representation of the Bill</a>, updated with the latest changes, is also mentioned, along with a caveat that it is already out of date again.</li></ul></p>"
  },
  {
    "episode": 327,
    "changes": "<p><a href=\"https://overcast.fm/+FXx4vzIxY/21:41\" target=\"_blank\">Clarified the difference</a> between Keynote and Annual Chairmanships.</p>"
  },
  {
    "episode": 328,
    "changes": "<p>\"Non-graded\" <a href=\"https://overcast.fm/+FXx644_TU/15:15\" target=\"_blank\">removed from the Flexie rules</a> by listener request.</p>"
  },
  {
    "episode": 348,
    "changes": "<p>Links to fan sites <a href=\"https://rickies.co\" target=\"_blank\">Rickies.co</a> and Rickipedia were added to the top of the document.</p>"
  },
  {
    "episode": 349,
    "changes": "<p><ul><li>Flexies <a href=\"https://overcast.fm/+FXx70G0aw/29:46\" target=\"_blank\">are changed to be graded purely by percentage</a>, which had been the rule in the hosts' minds for some time anyway. (For the record, this publication <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Thoughts%20on%20Flexies\">had some thoughts on this</a> and was very much <em>not</em> listened to. But at least now it's clear.) If the ratio is the same, the tie is broken by coin flip (even if the number of picks differ, e.g. 3/6 and 5/10).</li><li>The long standing practice of resolving ties with coin flips <a href=\"https://overcast.fm/+FXx70G0aw/34:20\" target=\"_blank\">was codified</a>, with a lifetime ban on Jason Snell flipping a physical coin.</li></ul></p>"
  },
  {
    "episode": 362,
    "changes": "<p><ul><li>The phrasing about annual pick order <a href=\"https://overcast.fm/+FXx5Crqo4/15:40\" target=\"_blank\">is modified to match</a> the phrasing of the Keynote order rule.</li><li>Dice by PCalc, in its Relay FM mode, <a href=\"https://overcast.fm/+FXx5Crqo4/16:36\" target=\"_blank\">is made the official method</a> of flipping coins. Jason Snell continues to be banned for life from flipping physical coins.</li></ul></p>"
  },
  {
    "episode": 367,
    "changes": "<p><ul>\n<li><a href=\"https://overcast.fm/+FXx6Hkxs4/19:48\" target=\"_blank\">Removed a redundant and inaccurate line</a> about access to the Twitter accounts.</li>\n<li>Resolving an issue that came up in the <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#2021%20September%20Rickies\">2021 September Rickies</a> (for <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#There%20will%20be%20a%20setting%20to%20disable%20the%20higher%20refresh%20rate%20in%20at%20least%20one%20of%20the%20new%20iPhones\">this pick</a> specifically), <a href=\"https://overcast.fm/+FXx6Hkxs4/20:27\" target=\"_blank\">picks can only be deemed correct</a> if publicly available information is available.</li>\n<li>Reuse of picks is revisited, and is <a href=\"https://overcast.fm/+FXx6Hkxs4/21:54\" target=\"_blank\">changed to be allowed after a year has passed</a>. How exactly to define a year is debated a bit, but 365 days is the ultimate answer. <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Ineligible%20Picks\">A list of ineligible picks can be found here</a>.</li>\n<li>The coin flip rules <a href=\"https://overcast.fm/+FXx6Hkxs4/1:13:50\" target=\"_blank\">are reworded</a>.</li>\n<li>It isn't part of the rules officially, but <a href=\"https://overcast.fm/+FXx6Hkxs4/25:38\" target=\"_blank\">a tangent leads to</a> the establishment of a Rickies Line of Succession, which also becomes a potential conspiracy to take over the show<a href=\"https://pickipedia.net\" target=\"_blank\">.</a></li>\n</ul></p>"
  },
  {
    "episode": 368,
    "changes": "<p><ul><li>Matt VanOrmer, Discord admin extraordinaire, <a href=\"https://www.peerreviewed.io/blog/2021/10/20/scorekeeping-across-borders\" target=\"_blank\">made an official physical trophy for The Rickies</a>, which can be changed to reflect the current Chairmanships. It is <a href=\"https://overcast.fm/+FXx5nWhwg/1:18:25\" target=\"_blank\">dubbed The Tricky</a> after its clever implementation. <a href=\"https://overcast.fm/+FXx5nWhwg/30:29\" target=\"_blank\">The rules are updated</a> with the proper procedures for the new trophy.</li></ul></p>"
  },
  {
    "episode": 379,
    "changes": "<p><ul><li><a href=\"https://overcast.fm/+FXx6bXcOY/19:13\" target=\"_blank\">Updated the name of the trophy</a> from \"official Rickies Trophy (Late 2021)\" to <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#The%20Tricky\">The Tricky</a>.</li><li>Although forgotten this episode, <a href=\"https://overcast.fm/+FXx6bXcOY/19:35\" target=\"_blank\">the Closing Ceremonies were established</a> for the changing of the trophies. Listeners should update their own MagTrickies at this time in their own private ceremony.</li></ul></p>"
  },
  {
    "episode": 387,
    "changes": "<p>Minor change to the wording of the Flexie winner's chosen title.</p>"
  },
  {
    "episode": 390,
    "changes": "<p>In a special post-vacation congress, Stephen <a href=\"https://overcast.fm/+FXx7vDugc/1:36:29\" target=\"_blank\">proposes a major restructuring of the rules</a> and a change to drop the 365 day reuse rule, but the others want some time to ponder first.</p>"
  },
  {
    "episode": 391,
    "changes": "<p><a href=\"https://overcast.fm/+FXx7XrK-k/59:03\" target=\"_blank\">Continuing from</a> the <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Connected%20%23390%3A%20The%20Permanence%20of%20Objects\">previous episode</a>'s discussion: \n<ul>\n<li>The pick reuse rule is discussed in depth, and ultimately gets relaxed a bit further. For Keynote games, hosts may not reuse <em>their own</em> picks from either the last Keynote event or the ongoing Annual game, but all other picks are available, including the picks of other hosts in any previous game. When picking for the Annual games, hosts may not reuse their own picks from the last year's game. As before, Flexies are always reusable. (The <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Ineligible%20Picks\">Ineligible Picks</a> page has been updated once again with each host's currently restricted picks.)</li></ul></p>"
  },
  {
    "episode": 392,
    "changes": "<p><a href=\"https://overcast.fm/+FXx6P6jvs/06:26\" target=\"_blank\">Tidying up from the last two weeks of Bill changes</a>, the language about Annual pick choices was revised, and the nickname \"The Annies\" was attached to the Annual games. Federico also takes advantage of <a href=\"https://github.com/lexpostma/Rickies/commit/9cc8a8b2a7b09796d94f758e755d366298ece012\" target=\"_blank\">the new API on Rickies.co</a> to create a new Shortcut.</p>"
  },
  {
    "episode": 404,
    "changes": "<p>Listener Jen points out that the hosts have misremembered what game The Annies are (it's the game where each month of the year is ranked in the year end review, not the <a class=\"tc-tiddlylink tc-tiddlylink-missing\" href=\"#Annual%20Rickies\">Annual Rickies</a>).</p>"
  },
  {
    "episode": 413,
    "changes": "<p><ul><li>When Stephen's <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#iOS%20gets%20split-view%20support%20for%20multitasking%20to%20use%202%20apps%20at%20once%20%28reuse%29\">Risky pick turns out to have been in the rumor mill</a> as has <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#iPadOS%20is%20updated%20to%20include%20a%20more%20desktop-like%20mode%20with%20resizable%20and%20overlapping%20windows\">happened to</a> him <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#MagSafe%20is%20updated%20to%20support%2020%20watt%20charging%20or%20higher%2C%20but%20a%20new%20puck%20is%20required\">a couple times</a> before, the Bill is <a href=\"https://overcast.fm/+FXx4UJ2RE/1:07:00\" target=\"_blank\">updated to codify an unwritten rule</a> that picks with rumors backing them up are, by definition, not risky. Specifically, <a href=\"https://9to5mac.com\" target=\"_blank\">9to5Mac</a> and <a href=\"https://www.macrumors.com\" target=\"_blank\">MacRumors</a> are chosen as the publications of record. Myke wants to call them \"publications of Rickord\" but that pun is shot down.</li></ul></p>"
  },
  {
    "episode": 431,
    "changes": "<p><ul><li>2022 saw some, uh, changes to Twitter, and the hosts <a href=\"https://overcast.fm/+FXx5wv1as/5:34\" target=\"_blank\">had basically left the site by the end of the year</a>. Thus, references to the <a href=\"https://twitter.com/KeynoteChairman\" target=\"_blank\">Keynote Chairman</a> and <a href=\"https://twitter.com/AnnualChairman\" target=\"_blank\">Annual Chairman</a> Twitter accounts were removed from the Bill, although the accounts themselves still exist. Besides, they had been intended to stand in for a traveling trophy, but with <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#The%20Tricky\">The Tricky</a> there's now an actual trophy that doesn't need international shipping multiple times a year. The idea of an entire Mastodon <em>instance</em> for the winners is proposed but left for later.</li><li><a href=\"https://overcast.fm/+FXx5wv1as/26:04\" target=\"_blank\">While finishing The Reading of The Rules for The Flexies</a>, the hosts for the first time begin to consider a difference between the Annual Flexies champion and the Keynote one. Myke proposes an upgrade to the \"chosen title\" system as a result: if a host has both Flexie crowns, he may use a more prestigious title. The titles are: \"King Flexie\" for Federico, \"Archduke of Flexington\" for Myke, and, after consulting the line of succession and discovering that the next higher in line for the US Presidency is the Secretary of Defense, \"Secretary of Deflex\" for Stephen.</li></ul></p>"
  },
  {
    "episode": 452,
    "changes": "<p>Not codified in the rules officially just yet, but <a href=\"https://overcast.fm/+FXx6N6Rqw/11:02\" target=\"_blank\">it was agreed</a> that a holder of all 4 titles (both Chairmanships and both Flexy titles) should be able to choose a title befitting his dominant performance.</p>"
  },
  {
    "episode": 466,
    "changes": "<p>Added to the rules about titles between episodes: <a href=\"https://overcast.fm/+FXx5s-OzI/1:09:35\" target=\"_blank\">if someone holds all four titles, they are allowed to choose their own moniker</a>.</p>"
  },
  {
    "episode": 473,
    "changes": "<p><ul><li>The rules for coin flips to resolve three way ties <a href=\"https://overcast.fm/+FXx52vzd4/19:05\" target=\"_blank\">are finally codified</a>.</li><li>The timing window of Keynote Rickies <a href=\"https://overcast.fm/+FXx52vzd4/20:29\" target=\"_blank\">is slightly expanded to when the live video stream starts rather than the actual event start time</a>, to accommodate <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#The%20David%20Guetta%20song%20plays%20either%20before%20or%20during%20the%20event\">a pick that was slightly out of bounds last time</a>.\n\n\n\n</li></ul></p>"
  },
  {
    "episode": 484,
    "changes": "<p>In a first attempt to end the multi-year drought of correct risky picks, the <a href=\"https://overcast.fm/+FXx6cG1WQ/45:11\" target=\"_blank\">rule that rumored picks are inherently not risky was removed</a>. At the beginning of 2024, the last correct risky picks had happened all the way back in <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#2020%20November%20Rickies\">November of 2020</a>. Federico also put out the idea of a Mario Kart-esque \"blue shell\" rule, giving a boost to a host on a losing streak, perhaps by allowing them a rule modification, but for now it's just an idea for everyone to ponder in their hearts.</p>"
  },
  {
    "episode": 505,
    "changes": "<p>A host who is both the current Keynote Chairman and Annual Chairman is henceforth known as the Ricky Benchman (think two chairs next to each other) and is introduced as such in <a href=\"https://connectedintro.com\" target=\"_blank\">the intro for every show</a>.</p>"
  }
]
